Pandas:
to perform scientific calculations and deal with Data Structures  (my:when you see this again you should have watered down DS )

In [174]:
import pandas as pd
import numpy as np

In [67]:
df=pd.DataFrame(np.arange(20,step=1).reshape(4,5))

In [68]:
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [69]:
df_1=pd.DataFrame(np.linspace(40,100,30).reshape(6,5),index=['Row1','R2','R3','R4','R5','R6'],
                  columns=['Column1','Column2','Column3','Column4','Column5'], dtype=int)

In [70]:
df_1

      Column1  Column2  Column3  Column4  Column5
Row1       40       42       44       46       48
R2         50       52       54       56       58
R3         60       62       64       66       68
R4         71       73       75       77       79
R5         81       83       85       87       89
R6         91       93       95       97      100

In [71]:
#Accesing specific elements
df_1.loc['R4']

Column1    71
Column2    73
Column3    75
Column4    77
Column5    79
Name: R4, dtype: int32

 storing this DataFrame to a csv or excel

df.to_csv('df_1')
df.to_excel('df_1')

df.read.csv('file',sep='anycomment')

In [73]:
type(df_1)

pandas.core.frame.DataFrame

In [74]:
type(df_1['Column1'])

pandas.core.series.Series

In [75]:
type(df_1.loc['Row1'])

pandas.core.series.Series

In [76]:
(df_1.loc['Row1']).shape

(5,)

In [159]:
#Take the elements || similar to that of slicing
df_1.iloc[:2,3:]

      Column4  Column5
Row1       46       48
R2         56       58

In [78]:
df_1

      Column1  Column2  Column3  Column4  Column5
Row1       40       42       44       46       48
R2         50       52       54       56       58
R3         60       62       64       66       68
R4         71       73       75       77       79
R5         81       83       85       87       89
R6         91       93       95       97      100

In [79]:
df_1['Column1']=pd.to_datetime(df_1['Column1'])

In [80]:
df_1

                           Column1  Column2  Column3  Column4  Column5
Row1 1970-01-01 00:00:00.000000040       42       44       46       48
R2   1970-01-01 00:00:00.000000050       52       54       56       58
R3   1970-01-01 00:00:00.000000060       62       64       66       68
R4   1970-01-01 00:00:00.000000071       73       75       77       79
R5   1970-01-01 00:00:00.000000081       83       85       87       89
R6   1970-01-01 00:00:00.000000091       93       95       97      100

In [81]:
# Converting df into  array

df_1.iloc[:,1:].values

array([[ 42,  44,  46,  48],
       [ 52,  54,  56,  58],
       [ 62,  64,  66,  68],
       [ 73,  75,  77,  79],
       [ 83,  85,  87,  89],
       [ 93,  95,  97, 100]])

In [82]:
df_1.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
Column5    0
dtype: int64

In [83]:
df_1['Column4'].value_counts()

56    1
97    1
66    1
77    1
46    1
87    1
Name: Column4, dtype: int64

In [84]:
df_1['Column4'].unique()

array([46, 56, 66, 77, 87, 97])

pd.read_csv()
pd.read_excel()

df.head()
df.tail()

In [194]:

sal=np.random.randint(1000,100000,100).reshape(100,1)
rate=np.random.rand(100,1).reshape(100,1)

arr=np.column_stack((sal,rate))

df=pd.DataFrame(arr,columns=['Salary','Rate_their_living'])

In [195]:
df

     Salary  Rate_their_living
0   70917.0           0.205291
1   29614.0           0.406907
2    9888.0           0.485278
3   26061.0           0.707352
4   27088.0           0.331185
..      ...                ...
95  29384.0           0.511967
96  97574.0           0.103435
97  52623.0           0.004499
98  60234.0           0.305207
99  27506.0           0.448527

[100 rows x 2 columns]

In [196]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Salary             100 non-null    float64
 1   Rate_their_living  100 non-null    float64
dtypes: float64(2)
memory usage: 1.7 KB

In [197]:
df['Salary']=df['Salary'].astype('int')

In [198]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Salary             100 non-null    int32
 1   Rate_their_living  100 non-null    float64
dtypes: float64(1), int32(1)
memory usage: 1.3 KB

In [199]:
df['Rate_their_living']=df['Rate_their_living'].apply(lambda x: str(x)[:3] )
df['Rate_their_living']=df['Rate_their_living'].astype('float32')

In [200]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Salary             100 non-null    int32
 1   Rate_their_living  100 non-null    float32
dtypes: float32(1), int32(1)
memory usage: 928.0 bytes

In [201]:
df=df[['Salary','Rate_their_living']]

In [202]:
df

    Salary  Rate_their_living
0    70917                0.2
1    29614                0.4
2     9888                0.4
3    26061                0.7
4    27088                0.3
..     ...                ...
95   29384                0.5
96   97574                0.1
97   52623                0.0
98   60234                0.3
99   27506                0.4

[100 rows x 2 columns]

In [203]:
df.describe()
# in this describe only the integer and floating pt. data is taken into condideration
# the descriptive stat of the features(limit of central tendency and dispersion in depicted here)

            Salary  Rate_their_living
count    100.00000         100.000000
mean   51862.21000           0.451000
std    28690.34689           0.285153
min     1320.00000           0.000000
25%    27401.50000           0.200000
50%    51647.00000           0.450000
75%    74605.25000           0.700000
max    99586.00000           0.900000

In [205]:
df[df['Rate_their_living']>0.5]

    Salary  Rate_their_living
3    26061                0.7
8    84221                0.7
9    43784                0.8
13   65430                0.6
15   76373                0.8
16   68169                0.7
18   89231                0.7
26   47852                0.7
30   65200                0.6
31    5287                0.7
34   28821                0.9
36   55914                0.9
38   17941                0.7
40   36823                0.6
42   90658                0.7
46   41122                0.8
47   50357                0.9
48   52867                0.7
50   96370                0.9
52   23312                0.8
56   99586                0.9
58   66816                0.9
59   99546                0.7
60    6095                0.7
62   46713                0.7
64   37393                0.8
66   23057                0.9
69   44536                0.8
70   48347                0.8
71   23687                0.8
72   50490                0.8
74   87191                0.7
83   79940                0.6
84   68629                0.9
85   69005                0.6
87   89641                0.7
91   20557                0.6
92   75578                0.8
94    3903                0.9